app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "jana"], ["email", "ydydu@kfif"], ["password", "hjfhfiu"], ["created_at", "2021-02-18 08:57:55.993234"], ["updated_at", "2021-02-18 08:57:55.993234"]]
---
	def create
	  #@user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)
	  if @user.save